#!/usr/bin/env python

import open3d as o3d
import numpy as np

points_A = [

[-0.19295161,  0.04283138 ,-1.37299878],#1
[ 0.46232933,  0.04395829 ,-1.63851427],#2
[ 2.12785518, -0.0085466  ,-0.67474334],#3
[ 1.93466332, -0.01129261 ,-1.11775634],#4
[ 1.50720236, -0.00695199 ,-2.11155629],#5
[ 2.97276625, -1.93470035, -2.73770529],#6
[ 3.17544446,  0.01449248, -2.79589114],#7
[ 0.86002442, -0.01150256, -3.62110468],#8   
[ 0.50271638, -0.0243833 , -0.20906271],#9
[ 0.02705305, -0.01838444, -3.04566892],#10
[ 1.91389687, -0.00628595, -3.86399824],#11

]


points_B = [
[0.217, 0, -2.05], #1
[0.92, 0, -2.05],  #2
[2.05, 0, -0.97],  #3
[2.05, 0, -0.49],  #4
[2.05, 0, -2.05],  #5
[3.648, 0, -2.05], #6
[3.858, 0, -2.05], #7
[2.05, 0, -3.72],  #8
[0.405, 0.004,-1.725],  #9
[1.053, 0.004, -3.507], #10
[3.01, 0.004, 0.573],  #11
]

# 点云数据 points_A 和 points_B ... (定义与您提供的一致)

def create_point_cloud(points):
    """
    从点列表创建 Open3D 点云对象。

    参数：
        points: 点列表，每个点包含 'position' 和 'orientation'。

    返回值：
        Open3D 点云对象。
    """

    pcd = o3d.geometry.PointCloud()
    pcd.points = o3d.utility.Vector3dVector( points)
    return pcd

# 创建 Open3D 点云对象
pcd_A = create_point_cloud(points_A)
pcd_B = create_point_cloud(points_B)

# 设置点云颜色
pcd_A.paint_uniform_color([1, 0, 0])  # 红色
pcd_B.paint_uniform_color([0, 0, 1])  # 蓝色

# 创建可视化窗口并显示点云
o3d.visualization.draw_geometries([pcd_A, pcd_B])